samopal-pro/svetofor_box_esp32/src/Webserver/WebServer.cpp
/*
  Fork samopal.pro 03.07.2026
  WebServer.cpp - Dead simple web-server.
  Supports only one simultaneous client, knows how to handle GET and POST.

  Original Copyright (c) 2014 Ivan Grokhotkov. All rights reserved.
  Modified 8 May 2015 by Hristo Gochkov (proper post and file upload handling)
  
  Changes:
  - Added conditional compilation for unused features
  - Removed authentication dependencies when WEBSERVER_NO_AUTH defined
  - Removed CORS/ETag/Chunked/SSE/Raw/Middleware when respective flags defined
  - Uri-based on() always compiles, uses SimpleRequestHandler when no REGEX
  - removeRoute() only with WEBSERVER_INCLUDE_REGEX
*/
#include "WebServerConfig.h"
#include <Arduino.h>
#include <esp32-hal-log.h>

// ===== CONDITIONAL INCLUDES =====
#ifdef WEBSERVER_INCLUDE_AUTH
  #include <libb64/cdecode.h>
  #include <libb64/cencode.h>
  #include "MD5Builder.h"
  #include "SHA1Builder.h"
  #include "base64.h"
#endif

#include "esp_random.h"
#include "NetworkServer.h"
#include "NetworkClient.h"
#include "WebServer.h"
#include "FS.h"
#include "detail/RequestHandlersImpl.h"

#ifdef WEBSERVER_INCLUDE_AUTH
static const char AUTHORIZATION_HEADER[] = "Authorization";
static const char qop_auth[] PROGMEM = "qop=auth";
static const char qop_auth_quoted[] PROGMEM = "qop=\"auth\"";
static const char WWW_Authenticate[] = "WWW-Authenticate";
#endif

static const char Content_Length[] = "Content-Length";

#ifdef WEBSERVER_INCLUDE_ETAG
static const char ETAG_HEADER[] = "If-None-Match";
#endif

WebServer::WebServer(IPAddress addr, int port) : _server(addr, port) {
  log_v("WebServer::Webserver(addr=%s, port=%d)", addr.toString().c_str(), port);
}

WebServer::WebServer(int port) : _server(port) {
  log_v("WebServer::Webserver(port=%d)", port);
}

WebServer::~WebServer() {
  _server.close();
  _clearRequestHeaders();
  _clearResponseHeaders();

  RequestHandler *handler = _firstHandler;
  while (handler) {
    RequestHandler *next = handler->next();
    delete handler;
    handler = next;
  }
  _firstHandler = nullptr;
}

void WebServer::begin() {
  close();
  _server.begin();
  _server.setNoDelay(true);
#ifdef IS_SET_ACTIVITY
  _lastRequestTime = 0;
#endif  
}

void WebServer::begin(uint16_t port) {
  close();
  _server.begin(port);
  _server.setNoDelay(true);
#ifdef IS_SET_ACTIVITY
  _lastRequestTime = 0;
#endif  
}

// ===== AUTHENTICATION METHODS =====
#ifdef WEBSERVER_INCLUDE_AUTH

String WebServer::_extractParam(String &authReq, const String &param, const char delimit) {
  int _begin = authReq.indexOf(param);
  if (_begin == -1) {
    return "";
  }
  return authReq.substring(_begin + param.length(), authReq.indexOf(delimit, _begin + param.length()));
}

static String md5str(String &in) {
  MD5Builder md5 = MD5Builder();
  md5.begin();
  md5.add(in);
  md5.calculate();
  return md5.toString();
}

bool WebServer::authenticateBasicSHA1(const char *_username, const char *_sha1Base64orHex) {
  return WebServer::authenticate([_username, _sha1Base64orHex](HTTPAuthMethod mode, String username, String params[]) -> String * {
    if (params == nullptr) {
      log_e("Something went wrong. params is NULL");
      return NULL;
    }

    uint8_t sha1[20];
    char sha1calc[48];
    String ret;
    SHA1Builder sha_builder;
    base64 b64;

    log_v("Trying to authenticate user %s using SHA1.", username.c_str());
    sha_builder.begin();
    sha_builder.add((uint8_t *)params[0].c_str(), params[0].length());
    sha_builder.calculate();
    sha_builder.getBytes(sha1);

    if (strlen(_sha1Base64orHex) == 20 * 2) {
      sha_builder.bytes2hex(sha1calc, sizeof(sha1calc), sha1, sizeof(sha1));
      log_v("Calculated SHA1 in hex: %s", sha1calc);
    } else {
      ret = b64.encode(sha1, sizeof(sha1));
      ret.toCharArray(sha1calc, sizeof(sha1calc));
      log_v("Calculated SHA1 in base64: %s", sha1calc);
    }

    return ((username.equalsConstantTime(_username)) && (String((char *)sha1calc).equalsConstantTime(_sha1Base64orHex))
            && (mode == BASIC_AUTH))
             ? new String(params[0])
             : NULL;
  });
}

bool WebServer::authenticate(const char *_username, const char *_password) {
  return WebServer::authenticate([_username, _password](HTTPAuthMethod mode, String username, String params[]) -> String * {
    (void)mode;
    (void)params;
    return username.equalsConstantTime(_username) ? new String(_password) : NULL;
  });
}

bool WebServer::authenticate(THandlerFunctionAuthCheck fn) {
  if (!hasHeader(FPSTR(AUTHORIZATION_HEADER))) {
    return false;
  }

  String authReq = header(FPSTR(AUTHORIZATION_HEADER));
  if (authReq.startsWith(AuthTypeBasic)) {
    log_v("Trying to authenticate using Basic Auth");
    bool ret = false;

    authReq = authReq.substring(6);
    authReq.trim();

    char *decoded = (authReq.length() < HTTP_MAX_BASIC_AUTH_LEN) ? new char[authReq.length()] : NULL;
    if (decoded) {
      char *p;
      if (base64_decode_chars(authReq.c_str(), authReq.length(), decoded) && (p = index(decoded, ':')) && p) {
        authReq = "";
        *p = '\0';
        char *_username = decoded, *_password = p + 1;
        String params[] = {_password, _srealm};
        String *password = fn(BASIC_AUTH, _username, params);

        if (password) {
          ret = password->equalsConstantTime(_password);
          memset((void *)password->c_str(), 0, password->length());
          delete password;
        }
      }
      delete[] decoded;
    }
    authReq = "";
    log_v("Authentication %s", ret ? "Success" : "Failed");
    return ret;
  } else if (authReq.startsWith(AuthTypeDigest)) {
    log_v("Trying to authenticate using Digest Auth");
    authReq = authReq.substring(7);
    log_v("%s", authReq.c_str());

    String _username = _extractParam(authReq, F("username=\""), '\"');
    String _realm = _extractParam(authReq, F("realm=\""), '\"');
    String _uri = _extractParam(authReq, F("uri=\""), '\"');
    if (!_username.length()) {
      goto exf;
    }
    String _uriPath = _uri;
    int qmarkIndex = _uriPath.indexOf('?');
    if (qmarkIndex >= 0) {
      _uriPath = _uriPath.substring(0, qmarkIndex);
    }
    if (_uriPath != _currentUri) {
      log_e("Authentication Failed: URI mismatch");
      goto exf;
    }

    String params[] = {_realm, _uri};
    String *password = fn(DIGEST_AUTH, _username, params);
    if (!password) {
      goto exf;
    }

