samopal-pro/svetofor_box_esp32/src/Webserver/WebServer.cpp
      delete current;
      return true;
    }
    previous = current;
    current = current->next();
  }
  return false;
}

void WebServer::serveStatic(const char *uri, FS &fs, const char *path, const char *cache_header) {
  _addRequestHandler(new StaticRequestHandler(fs, path, uri, cache_header));
}

// ===== MAIN CLIENT HANDLER =====
void WebServer::handleClient() {
  if (_currentStatus == HC_NONE) {
    _currentClient = _server.accept();
    if (!_currentClient) {
      if (_nullDelay) {
        delay(1);
      }
      return;
    }
#ifdef IS_SET_ACTIVITY    
    _updateActivity();  // Новое подключение
#endif
    log_v("New client: client.localIP()=%s", _currentClient.localIP().toString().c_str());

    _currentStatus = HC_WAIT_READ;
    _statusChange = millis();
  }

  bool keepCurrentClient = false;
  bool callYield = false;

  if (_currentClient.connected()) {
    switch (_currentStatus) {
      case HC_NONE:
        break;
      case HC_WAIT_READ:
        if (_currentClient.available()) {
#ifdef IS_SET_ACTIVITY          
          _updateActivity();  // Получен запрос
#endif
          _currentClient.setTimeout(HTTP_MAX_SEND_WAIT);
          if (_parseRequest(_currentClient)) {
            _contentLength = CONTENT_LENGTH_NOT_SET;
            _responseCode = 0;
            _clearResponseHeaders();

            _handleRequest();

            #ifdef WEBSERVER_INCLUDE_SSE
              if (_currentClient.isSSE()) {
                _currentStatus = HC_WAIT_CLOSE;
                _statusChange = millis();
                keepCurrentClient = true;
              }
            #endif
          }
        } else {
          if (millis() - _statusChange <= HTTP_MAX_DATA_WAIT) {
            keepCurrentClient = true;
          }
          callYield = true;
        }
        break;
      case HC_WAIT_CLOSE:
        #ifdef WEBSERVER_INCLUDE_SSE
          if (_currentClient.isSSE()) {
            _statusChange = millis();
          }
        #endif
        if (millis() - _statusChange <= HTTP_MAX_CLOSE_WAIT) {
          keepCurrentClient = true;
          callYield = true;
        }
    }
  }

  if (!keepCurrentClient) {
    _currentClient = NetworkClient();
    _currentStatus = HC_NONE;
    _currentUpload.reset();
    #ifdef WEBSERVER_INCLUDE_RAW
      _currentRaw.reset();
    #endif
  }

  if (callYield) {
    yield();
  }
}

void WebServer::close() {
  _server.close();
  _currentStatus = HC_NONE;
  if (!_headerKeysCount) {
    collectHeaders(0, 0);
  }
}

void WebServer::stop() {
  close();
}

// ===== HEADER MANIPULATION =====
void WebServer::sendHeader(const String &name, const String &value, bool first) {
  if (name.indexOf('\r') != -1 || name.indexOf('\n') != -1) {
    log_e("Invalid character in HTTP header name");
    return;
  }

  if (value.indexOf('\r') != -1 || value.indexOf('\n') != -1) {
    log_e("Invalid character in HTTP header value");
    return;
  }

  RequestArgument *header = new RequestArgument();
  header->key = name;
  header->value = value;

  if (!_responseHeaders || first) {
    header->next = _responseHeaders;
    _responseHeaders = header;
  } else {
    RequestArgument *last = _responseHeaders;
    while (last->next) {
      last = last->next;
    }
    last->next = header;
  }

  _responseHeaderCount++;
}

void WebServer::setContentLength(const size_t contentLength) {
  _contentLength = contentLength;
}

void WebServer::enableDelay(boolean value) {
  _nullDelay = value;
}

// ===== CORS =====
#ifdef WEBSERVER_INCLUDE_CORS

void WebServer::enableCORS(boolean value) {
  _corsEnabled = value;
}

void WebServer::enableCrossOrigin(boolean value) {
  enableCORS(value);
}

#endif // WEBSERVER_INCLUDE_CORS

// ===== ETAG =====
#ifdef WEBSERVER_INCLUDE_ETAG

void WebServer::enableETag(bool enable, ETagFunction fn) {
  _eTagEnabled = enable;
  _eTagFunction = fn;
}

#endif // WEBSERVER_INCLUDE_ETAG

// ===== CHUNKED RESPONSE =====
#ifdef WEBSERVER_INCLUDE_CHUNKED

void WebServer::chunkResponseBegin(const char *contentType) {
  if (_chunkedResponseActive) {
    log_e("Already in chunked response mode");
    return;
  }

  if (strchr(contentType, '\r') || strchr(contentType, '\n')) {
    log_e("Invalid character in content type");
    return;
  }

  _chunkedResponseActive = true;
  _chunkedClient = _currentClient;

  _contentLength = CONTENT_LENGTH_UNKNOWN;

  String header;
  _prepareHeader(header, 200, contentType, 0);
  _currentClientWrite(header.c_str(), header.length());

  _chunkedResponseActive = true;
  _chunkedClient = _currentClient;
}

void WebServer::chunkWrite(const char *data, size_t length) {
  if (!_chunkedResponseActive) {
    log_e("Chunked response has not been started");
    return;
  }

  char chunkSize[11];
  snprintf(chunkSize, sizeof(chunkSize), "%lx\r\n", (unsigned long)length);

  if (_chunkedClient.write(chunkSize) != strlen(chunkSize)) {
    log_e("Failed to write chunk size");
    _chunkedResponseActive = false;
    return;
  }

  if (_chunkedClient.write((const uint8_t *)data, length) != length) {
    log_e("Failed to write chunk data");
    _chunkedResponseActive = false;
    return;
  }

  if (_chunkedClient.write("\r\n") != 2) {
    log_e("Failed to write chunk terminator");
    _chunkedResponseActive = false;
    return;
  }
}

void WebServer::chunkResponseEnd() {
  if (!_chunkedResponseActive) {
    log_e("Chunked response has not been started");
    return;
  }

  if (_chunkedClient.write("0\r\n\r\n", 5) != 5) {
    log_e("Failed to write terminating chunk");
  }

  _chunkedClient.clear();
  _chunkedResponseActive = false;
  _chunked = false;
  _chunkedClient = NetworkClient();

  _clearResponseHeaders();
}

#endif // WEBSERVER_INCLUDE_CHUNKED

// ===== RESPONSE PREPARATION =====
void WebServer::_prepareHeader(String &response, int code, const char *content_type, size_t contentLength) {
  _responseCode = code;

  response.concat(version());
  response.concat(' ');
  response.concat(String(code));
  response.concat(' ');
  response.concat(responseCodeToString(code));
  response.concat(F("\r\n"));

  using namespace mime;
  if (!content_type) {
    content_type = mimeTable[html].mimeType;
  }

  sendHeader(String(F("Content-Type")), String(FPSTR(content_type)), true);
  if (_contentLength == CONTENT_LENGTH_NOT_SET) {
    sendHeader(String(FPSTR(Content_Length)), String(contentLength));
  }
  #ifdef WEBSERVER_INCLUDE_CHUNKED
    else if (_contentLength != CONTENT_LENGTH_UNKNOWN) {
      sendHeader(String(FPSTR(Content_Length)), String(_contentLength));
    } else if (_contentLength == CONTENT_LENGTH_UNKNOWN && _currentVersion) {
      _chunked = true;
      sendHeader(String(F("Accept-Ranges")), String(F("none")));
      sendHeader(String(F("Transfer-Encoding")), String(F("chunked")));
    }
  #else
    else if (_contentLength != CONTENT_LENGTH_UNKNOWN) {
      sendHeader(String(FPSTR(Content_Length)), String(_contentLength));
    }
  #endif

