samopal-pro/svetofor_box_esp32/src/Webserver/WebServer.cpp
  #ifdef WEBSERVER_INCLUDE_CORS
    if (_corsEnabled) {
      sendHeader(String(FPSTR("Access-Control-Allow-Origin")), String("*"));
      sendHeader(String(FPSTR("Access-Control-Allow-Methods")), String("*"));
      sendHeader(String(FPSTR("Access-Control-Allow-Headers")), String("*"));
    }
  #endif

  sendHeader(String(F("Connection")), String(F("close")));

  for (RequestArgument *header = _responseHeaders; header; header = header->next) {
    response.concat(header->key);
    response.concat(F(": "));
    response.concat(header->value);
    response.concat(F("\r\n"));
  }

  response.concat(F("\r\n"));
}

void WebServer::send(int code, const char *content_type, const String &content) {
  String header;
  _prepareHeader(header, code, content_type, content.length());
  _currentClientWrite(header.c_str(), header.length());
  if (content.length()) {
    sendContent(content);
  }
}

void WebServer::send(int code, char *content_type, const String &content) {
  send(code, (const char *)content_type, content);
}

void WebServer::send(int code, const String &content_type, const String &content) {
  send(code, (const char *)content_type.c_str(), content);
}

void WebServer::send(int code, const char *content_type, const char *content) {
  const String passStr = (String)content;
  if (strlen(content) != passStr.length()) {
    log_e("String cast failed.  Use send_P for long arrays");
  }
  send(code, content_type, passStr);
}

void WebServer::send(int code, const char *content_type, Stream &stream, size_t content_length) {
  if (!content_length) {
    content_length = stream.available();
    if (!content_length) {
      send(204);
      return;
    }
  }
  String header;
  _prepareHeader(header, code, content_type, content_length);
  _currentClientWrite(header.c_str(), header.length());
  _currentClient.write(stream, content_length);
}

void WebServer::send_P(int code, PGM_P content_type, PGM_P content) {
  size_t contentLength = 0;

  if (content != NULL) {
    contentLength = strlen_P(content);
  }

  String header;
  char type[64];
  memccpy_P((void *)type, (PGM_VOID_P)content_type, 0, sizeof(type));
  _prepareHeader(header, code, (const char *)type, contentLength);
  _currentClientWrite(header.c_str(), header.length());
  sendContent_P(content);
}

void WebServer::send_P(int code, PGM_P content_type, PGM_P content, size_t contentLength) {
  String header;
  char type[64];
  memccpy_P((void *)type, (PGM_VOID_P)content_type, 0, sizeof(type));
  _prepareHeader(header, code, (const char *)type, contentLength);
  sendContent(header);
  sendContent_P(content, contentLength);
}

void WebServer::sendContent(const String &content) {
  sendContent(content.c_str(), content.length());
}

void WebServer::sendContent(const char *content, size_t contentLength) {
  const char *footer = "\r\n";

  #ifdef WEBSERVER_INCLUDE_CHUNKED
    if (_chunked) {
      char *chunkSize = (char *)malloc(19);
      if (chunkSize) {
        snprintf(chunkSize, 19, "%lx%s", (unsigned long)contentLength, footer);
        _currentClientWrite(chunkSize, strlen(chunkSize));
        free(chunkSize);
      }
    }
  #endif

  _currentClientWrite(content, contentLength);

  #ifdef WEBSERVER_INCLUDE_CHUNKED
    if (_chunked) {
      _currentClient.write(footer, 2);
      if (contentLength == 0) {
        _chunked = false;
      }
    }
  #endif
}

void WebServer::sendContent_P(PGM_P content) {
  sendContent_P(content, strlen_P(content));
}

void WebServer::sendContent_P(PGM_P content, size_t size) {
  const char *footer = "\r\n";

  #ifdef WEBSERVER_INCLUDE_CHUNKED
    if (_chunked) {
      char *chunkSize = (char *)malloc(19);
      if (chunkSize) {
        snprintf(chunkSize, 19, "%lx%s", (unsigned long)size, footer);
        _currentClientWrite(chunkSize, strlen(chunkSize));
        free(chunkSize);
      }
    }
  #endif

  _currentClientWrite_P(content, size);

  #ifdef WEBSERVER_INCLUDE_CHUNKED
    if (_chunked) {
      _currentClient.write(footer, 2);
      if (size == 0) {
        _chunked = false;
      }
    }
  #endif
}

void WebServer::_streamFileCore(const size_t fileSize, const String &fileName, const String &contentType, const int code) {
  using namespace mime;
  setContentLength(fileSize);
  if (fileName.endsWith(String(FPSTR(mimeTable[gz].endsWith))) && contentType != String(FPSTR(mimeTable[gz].mimeType))
      && contentType != String(FPSTR(mimeTable[none].mimeType))) {
    sendHeader(F("Content-Encoding"), F("gzip"));
  }
  send(code, contentType, "");
  setContentLength(CONTENT_LENGTH_NOT_SET);
}

String WebServer::pathArg(unsigned int i) const {
  if (_currentHandler != nullptr) {
    return _currentHandler->pathArg(i);
  }
  return "";
}

String WebServer::arg(const String &name) const {
  for (int j = 0; j < _postArgsLen; ++j) {
    if (_postArgs[j].key == name) {
      return _postArgs[j].value;
    }
  }
  for (int i = 0; i < _currentArgCount; ++i) {
    if (_currentArgs[i].key == name) {
      return _currentArgs[i].value;
    }
  }
  return "";
}

String WebServer::arg(int i) const {
  if (i < _currentArgCount) {
    return _currentArgs[i].value;
  }
  return "";
}

String WebServer::argName(int i) const {
  if (i < _currentArgCount) {
    return _currentArgs[i].key;
  }
  return "";
}

int WebServer::args() const {
  return _currentArgCount;
}

bool WebServer::hasArg(const String &name) const {
  for (int j = 0; j < _postArgsLen; ++j) {
    if (_postArgs[j].key == name) {
      return true;
    }
  }
  for (int i = 0; i < _currentArgCount; ++i) {
    if (_currentArgs[i].key == name) {
      return true;
    }
  }
  return false;
}

String WebServer::header(const String &name) const {
  for (RequestArgument *current = _currentHeaders; current; current = current->next) {
    if (current->key.equalsIgnoreCase(name)) {
      return current->value;
    }
  }
  return "";
}

void WebServer::collectHeaders(const char *headerKeys[], const size_t headerKeysCount) {
  collectAllHeaders();
  _collectAllHeaders = false;

  _headerKeysCount += headerKeysCount;

  RequestArgument *last = _currentHeaders->next;

  for (int i = 2; i < _headerKeysCount; i++) {
    last->next = new RequestArgument();
    last->next->key = headerKeys[i - 2];
    last = last->next;
  }
}

String WebServer::header(int i) const {
  RequestArgument *current = _currentHeaders;
  while (current && i--) {
    current = current->next;
  }
  return current ? current->value : emptyString;
}

String WebServer::headerName(int i) const {
  RequestArgument *current = _currentHeaders;
  while (current && i--) {
    current = current->next;
  }
  return current ? current->key : emptyString;
}

int WebServer::headers() const {
  return _headerKeysCount;
}

bool WebServer::hasHeader(const String &name) const {
  return header(name).length() > 0;
}

String WebServer::hostHeader() const {
  return _hostHeader;
}

